robotology/icub-firmware/emBODY/arch-dspic33/apps/others/2foc-icubProto/app-added/can_icubProto_parser.c
        case ICUBPROTO_POLLINGCMD_ENABLE_PWM_PAD: // DS402 Switch On 
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0;
                return(0);
            }
            
			
            // Command can be accepted only if current ststus is SWITCH ON DISABLED 
            if(1 != DS402_Statusword.Flags.ReadyToSwitchOn )
            {
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_DS402_INVALID_STATUS_CHANGE;
                  *txlen = 0;
                  return(0);
            }
		
		    received_canloader_msg=0; // start to transmit status messages

            // go to Switch On state
            DS402_Controlword.Flags.SwitchOn = 1;
        }break;
        
        case ICUBPROTO_POLLINGCMD_CONTROLLER_IDLE: // DS402 Shutdown
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            // Command can be accepted only if current ststus is OPERATION ENABLE or SWITCHED ON 
            if ( (1 != DS402_Statusword.Flags.OperationEnabled ) && (1 != DS402_Statusword.Flags.SwitchedOn ) )
            {
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_DS402_INVALID_STATUS_CHANGE;
                *txlen = 0x0;
                return(0);
            }

            // go to Ready to Switch On state
            DS402_Controlword.Flags.EnableVoltage = 0;   
        }break;
        
        case ICUBPROTO_POLLINGCMD_GET_CONTROL_MODE:
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            
            txpayload->b[1] = CanIcubProtoGetcontrol_mode();
            if( controlMode_error == txpayload->b[1])
            {
//                *txlen = 0x1;
//                txpayload->b[0] =  CAN_ERROR_INCONSISTENT_STATE;
                *txlen = 0x0;
                return(0);
            }

            txpayload->b[0] = cmd;
            *txlen = 0x2;

        }break;

        case ICUBPROTO_POLLINGCMD_SET_CONTROL_MODE:
        {
            if(2 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }

            //this command has effect only when i'm in enable operation state
            if(1 != DS402_Controlword.Flags.EnableOperation)
            {
//                *txlen = 0x1;
//                txpayload->b[1] = CAN_ERROR_COMMAND_IN_INVALID_STATE;
                *txlen = 0x0;
                return(0);    
            }

            //let change control mode on fly
            s_controlMode_reset();

            switch(rxpayload->b[1])
            {           
                case ICUBPROTO_CONTROLMODE_CURRENT:
                {
                    SysStatus.TorqueControl = 1;
					current_open_loop=0;
                }break;
                case ICUBPROTO_CONTROLMODE_VELOCITY:
                {
                    SysStatus.SpeedControl = 1;
                }break;
                
                case ICUBPROTO_CONTROLMODE_IDLE:
                {
                    // go to Switched On state
                    DS402_Controlword.Flags.EnableOperation = 0;
                }break;

                case ICUBPROTO_CONTROLMODE_POSITION:
				{
				}break;
                case ICUBPROTO_CONTROLMODE_OPENLOOP:
				{
					SysStatus.TorqueControl = 1;
					current_open_loop=1;
				}break;	
                case ICUBPROTO_CONTROLMODE_TORQUE:
                {
                   s_controlMode_setDefault();
                }break;
 
                default:
                {
                    s_controlMode_setDefault();
                }break;
            }

        }break;

        case ICUBPROTO_POLLINGCMD_WRITE_FLASH_MEM:
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
#ifndef CAN_CMD_ALWAYS_ACCEPT
            if ( (1 != DS402_Statusword.Flags.OperationEnabled ) && (1 != DS402_Statusword.Flags.SwitchedOn ) )
            {
              *txlen=0x1;
              txpayload->b[0] =  CAN_ERROR_COMMAND_IN_INVALID_STATE;
              return(0);
            }
#endif
            EepromSave();
        }break;
        
        case ICUBPROTO_POLLINGCMD_GET_ADDITIONAL_INFO:
        {
            ;   //todo
        }break;

        case ICUBPROTO_POLLINGCMD_SET_ADDITIONAL_INFO:
        {
            ;   //todo
        }break;
        
        case ICUBPROTO_POLLINGCMD_GET_DESIRED_VELOCITY: 
        {
            ;  //todo 
        }break;
        
        case ICUBPROTO_POLLINGCMD_SET_DESIRED_VELOCITY: 
        {
            ;  //todo 
        }break;

        case ICUBPROTO_POLLINGCMD_SET_ENCODER_POSITION: 
        {
            
		// setta l'offset di fasatura 
		Encoder_SyncPulsePosition=(rxpayload->b[2] << 8 | rxpayload->b[1]);  //todo aspetta maggia
        }break;
        
        
        case ICUBPROTO_POLLINGCMD_GET_BOARD_ID: 
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            *txlen = 0x2;
            txpayload->b[0] = cmd;
            txpayload->b[1] = canprotoparser_bid;
        }break;

        case ICUBPROTO_POLLINGCMD_SET_BOARD_ID: 
        {
//            *txlen=0x1;
//             txpayload->b[0] = CAN_PROTO_ERROR_COMMAND_NOT_INPLEMENTED;
              *txlen=0x0;
             return(0);
            
