robotology/icub-firmware/emBODY/arch-dspic33/apps/others/2foc-icubProto/app-added/can_icubProto_parser.c
            /* currently it is NOT possible change board can address, 
            so the code below is commented, but it is right. */

//            if(2 != rxlen)
//            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
//                return(0);
//            }
//#ifndef CAN_CMD_ALWAYS_ACCEPT
//            if ( (1 != DS402_Statusword.Flags.OperationEnabled ) && (1 != DS402_Statusword.Flags.SwitchedOn ) )
//            {
//              *txlen=0x1;
//              txpayload->b[0] =  CAN_ERROR_COMMAND_IN_INVALID_STATE;
//              return(0);
//            }
//#endif
//            ApplicationData.EepromHeader.EE_CAN_BoardAddress = rxpayload->b[1];
//            canprotoparser_bid = rxpayload->b[1];
//            CanIcubProtoTransmitterUpdateBoardId(canprotoparser_bid);
//            CanIcubProtoSetFilters(canprotoparser_bid);
        }break;
        
        case ICUBPROTO_POLLINGCMD_SET_MAX_VELOCITY: 
        {
            ; //aspetta maggia
			//
        }break;

        case ICUBPROTO_POLLINGCMD_GET_MAX_VELOCITY: 
        {
            ; //aspetta maggia
        }break;

        case ICUBPROTO_POLLINGCMD_SET_CURRENT_LIMIT: 
        {
         
			
			if(5 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
		
		//il dato che arriva è espresso in mA va trasformato in IAD della 2FOC (1A 1310) 
			ApplicationData.CurLimit=((rxpayload->b[2] << 8 | rxpayload->b[1])*1310)/1000;
 
        }break;
        
        case ICUBPROTO_POLLINGCMD_GET_FIRMWARE_VERSION: 
        {
            ; //todo da leggere dalla partizione giusta della eeprom
        }break;
        
        case ICUBPROTO_POLLINGCMD_SET_CURRENT_PID: 
        {
            SFRAC16 pp, pi, pd, pm; //pm non viene passato dal comando 

            if(7 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            ControllerGetCurrentDPIDParm(&pp,&pi,&pd,&pm);
            pp = (rxpayload->b[2] << 8 | rxpayload->b[1]);
            pi = (rxpayload->b[4] << 8 | rxpayload->b[3]);
            pd = (rxpayload->b[6] << 8 | rxpayload->b[5]);

            ControllerSetCurrentDPIDParm(pp,pi,pd,pm);
	    ControllerSetCurrentQPIDParm(pp,pi,pd,pm);
        }break;
        
        case ICUBPROTO_POLLINGCMD_GET_CURRENT_PID: 
        {
            signed int p, i, d, m; 
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            
            ControllerGetCurrentDPIDParm(&p, &i, &d, &m);
            txpayload->b[0] = cmd;
            memcpy(&txpayload->b[1], &p, 2);
            memcpy(&txpayload->b[3], &i, 2);
            memcpy(&txpayload->b[5], &d, 2);
            *txlen = 0x7;   
        }break;
        
        case ICUBPROTO_POLLINGCMD_SET_VELOCITY_PID: 
        {
            SFRAC16 pp, pi, pd, pm; //pm non viene passato dal comando 
            
            if(7 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            ControllerGetWPIDParm(&pp,&pi,&pd,&pm);
            pp = (rxpayload->b[2] << 8 | rxpayload->b[1]);
            pi = (rxpayload->b[4] << 8 | rxpayload->b[3]);
            pd = (rxpayload->b[6] << 8 | rxpayload->b[5]); 
            ControllerSetWPIDParm(pp,pi,pd,pm);
        }break;
        
        case ICUBPROTO_POLLINGCMD_GET_VELOCITY_PID: 
        {
            signed int p, i, d, m;

            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            ControllerGetWPIDParm(&p, &i, &d, &m);
            txpayload->b[0] = cmd;
            memcpy(&txpayload->b[1], &p, 2);
            memcpy(&txpayload->b[3], &i, 2);
            memcpy(&txpayload->b[5], &d, 2);
            *txlen = 0x7;
        }break;
                
        case ICUBPROTO_POLLINGCMD_SET_DESIRED_CURRENT: 
        {
			SFRAC16 IqRef;
            if(5 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            
#ifndef CAN_CMD_ALWAYS_ACCEPT
            if ( (1 != DS402_Statusword.Flags.OperationEnabled ) && (1 != DS402_Statusword.Flags.SwitchedOn ) )
            {
//              *txlen=0x1;
//              txpayload->b[0] =  CAN_ERROR_COMMAND_IN_INVALID_STATE;
              *txlen = 0x0;
              return(0);
            }
#endif
            // Torque control references
			IqRef = (rxpayload->b[2] << 8 | rxpayload->b[1]);
			if ((IqRef>0) && (IqRef>ApplicationData.CurLimit));
			IqRef=ApplicationData.CurLimit;
			if ((IqRef<0) && (IqRef<ApplicationData.CurLimit));
			IqRef=-ApplicationData.CurLimit;            
			CtrlReferences.qIqRef=IqRef;
            // set reference value for toggling torque
            TorqueTogglingReference = CtrlReferences.qIqRef;

            // Flux control references
            CtrlReferences.qIdRef = (rxpayload->b[4] << 8 | rxpayload->b[3]);  

#ifdef SYNC_2FOC_TO_EMS
            CanIcubProtoTrasmitterSendPeriodicData();          
#endif    
        }break;
        
