robotology/icub-firmware/emBODY/arch-dspic33/apps/others/2foc-icubProto/app-added/can_icubProto_parser.c
        case ICUBPROTO_POLLINGCMD_GET_DESIRED_CURRENT: 
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            
            *txlen=0x5;
            txpayload->b[0] = cmd;
            memcpy(&txpayload->b[1], &CtrlReferences.qIqRef, 2);
            memcpy(&txpayload->b[3], &CtrlReferences.qIdRef, 2);    
        }break;

        case ICUBPROTO_POLLINGCMD_SET_PERIODIC_MSG_CONTENTS: 
        {
            if(5 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            
            // check data to transmit if in the acceptable range 
            if ( (rxpayload->b[1] < ELEMENTS_IN_PREIODIC_DATA_LIST )
              && (rxpayload->b[2] < ELEMENTS_IN_PREIODIC_DATA_LIST )
              && (rxpayload->b[3] < ELEMENTS_IN_PREIODIC_DATA_LIST )
              && (rxpayload->b[4] < ELEMENTS_IN_PREIODIC_DATA_LIST ))
            {
                // set the data to transmit
                PeriodicMessageContents[0] = rxpayload->b[1];
                PeriodicMessageContents[1] = rxpayload->b[2];
                PeriodicMessageContents[2] = rxpayload->b[3];
                PeriodicMessageContents[3] = rxpayload->b[4];

                // precalculate this here. This is an optimization
                gulpadr1 = (unsigned int*)PeriodicData[PeriodicMessageContents[0]];
                gulpadr2 = (unsigned int*)PeriodicData[PeriodicMessageContents[1]];
                gulpadr3 = (unsigned int*)PeriodicData[PeriodicMessageContents[2]];
                gulpadr4 = (unsigned int*)PeriodicData[PeriodicMessageContents[3]];
            }
            else
            {
              // parameter out of range
//              *txlen=0x1;
//              txpayload->b[0] = CAN_ERROR_PARAMETER_OUT_OF_RANGE;
                *txlen = 0x0;
              return(0);
            }
        }break;
        
        case ICUBPROTO_POLLINGCMD_SET_I2T_PARAMS:
        {
            if(5 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            //extract params from the 1st word
             I2Tdata.Param = (rxpayload->b[2] <<8 | rxpayload->b[1]);
             I2Tdata.IThreshold = (rxpayload->b[4] <<8 | rxpayload->b[3]);
        }break;
        
        case ICUBPROTO_POLLINGCMD_GET_I2T_PARAMS:
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            *txlen = 5;
            txpayload->b[0] = cmd;
            memcpy(&txpayload->b[1], &I2Tdata.Param, 2); 
            memcpy(&txpayload->b[3], &I2Tdata.IThreshold, 2);
        }break;
        
        default:
        {
            //ICUBPROTO_PAYLOAD_ERROR_SET(txpayload, txlen, CAN_PROTO_ERROR_UNKNOWN_COMMAND);
            *txlen = 0;
            return(0);
        }
    } //end switch
    return(1);
}

static int s_canIcubProtoParser_parse_periodicMsg(unsigned char permsg_type, tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen)
{
#ifndef DESIRED_CURR_IN_PER_MSG_BY_EMS
    //ICUBPROTO_PAYLOAD_ERROR_SET(txpayload, txlen, CAN_PROTO_ERROR_UNKNOWN_COMMAND);
    *txlen = 0;
    return(0);
#else
    
    switch(permsg_type)
    {
        case ICUBPROTO_PERIODICCMD_EMSTO2FOC_DESIRED_CURRENT:
        {
            if((canprotoparser_bid*2) > rxlen)
            {
                //ICUBPROTO_PAYLOAD_ERROR_SET(txpayload, txlen, CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS);
                *txlen = 0;
                return(0);
            }
             // Torque control references
            CtrlReferences.qIqRef = rxpayload->w[canprotoparser_bid-1];
            // set reference value for toggling torque
            TorqueTogglingReference = CtrlReferences.qIqRef;
#ifdef SYNC_2FOC_TO_EMS
            CanIcubProtoTrasmitterSendPeriodicData();          
#endif   
			*txlen = 0;
			return(1);
        }break;
       
        default:
        {
            //ICUBPROTO_PAYLOAD_ERROR_SET(txpayload, txlen, CAN_PROTO_ERROR_UNKNOWN_COMMAND);
            *txlen = 0;
            return(0);
        }

    }

#endif    
}

static int s_canIcubProtoParser_parse_canLoaderMsg(tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen)
{
    unsigned char cmd;

    cmd = rxpayload->b[0];
    *txlen = 0;
	
	
	switch (cmd)
    {
        case CMD_BROADCAST: 
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
			
			received_canloader_msg=1; // do not transmit status messages

            *txlen = 5;
            txpayload->b[0] = cmd;
            txpayload->b[1] = BOARD_TYPE_2FOC; 
            txpayload->b[2] = 1;  //TODO  //Firmware version number for BOOTLOADER c
            txpayload->b[3] = 0;  //TODO   //Firmware build number.
            txpayload->b[4] = 6;  //TODO   //Firmware build number. 
            #warning solita incoerenza tra versioni di fw sensori ed motori            
        } break;
                
    
        case CMD_BOARD:
        {
            asm ("reset");    // Jump to bootloader code      
        } break;
    
        case CMD_GET_ADDITIONAL_INFO:
        {
            ;
        } break;
    
        case CMD_SET_ADDITIONAL_INFO:
        {
            ;
        } break;
        
                
        default:
        {
            //ICUBPROTO_PAYLOAD_ERROR_SET(txpayload, txlen, CAN_PROTO_ERROR_UNKNOWN_COMMAND);
            *txlen = 0;
            return(0);
        } break;
        
        
    } //end switch

    return(1);    

}
